## SQL AS DATA SCIENTISTS USING PYTHON JUPYTER NOTEBOOK

> **Problem Statement:** The International Olympic Committee (IOC) is worried about having several CSV and is apprehensive about extracting information from various CSV. A database is essential for them. I've been hired to handle data storage and database queries.

In [1]:
# Importing of libraries
import pandas as pd
import sqlite3
import os

In [2]:
os.getcwd()

'C:\\Users\\Dell\\Documents\\sql-course-materials\\SQL Course Materials'

In [3]:
## Creating path to where sql datafile is stored
path="C:/Users/Dell/Documents/sql-course-materials/SQL Course Materials/Olympic_Data.db"

In [4]:
# Creating connector object

connector=sqlite3.connect(path,detect_types=sqlite3.PARSE_DECLTYPES | sqlite3.PARSE_COLNAMES)

In [5]:
# creating cursor to be used to execute sql statement 
curr=connector.cursor()

In [6]:
# Path for the dataset
datapath="C:/Users/Dell/Documents/sql-course-materials/SQL Course Materials/Olypmic/"

In [7]:
os.chdir(datapath)

In [8]:
# Load all the dataset
df_Bio=pd.read_csv("Olympic_Athlete_Bio.csv")
df_Event=pd.read_csv("Olympic_Athlete_Event_Results.csv")
df_Medal=pd.read_csv("Olympic_Games_Medal_Tally.csv")
df_Results=pd.read_csv("Olympic_Results.csv")
df_Country=pd.read_csv("Olympics_Country.csv")
df_Games=pd.read_csv("Olympics_Games.csv")

### Basic Dataset Information
This dataset contains: - 154,902 unique athletes and their biological information i.e. height, weight, date of birth - All Winter / Summer Olympic games from 1896 to 2022 - 7326 unique results (result for a specific event played at an Olympic game) - 314,726 rows of athlete to result data which includes both team sports and individual sports - each row includes position - which is how well the athlete performed for the specific event (Ranked) - Note: not all position is integer - contains strings which contains information on which round / heat they achieved - 235 distinct countries (some existing from the past)

In [9]:
# View the Althlete Biography dataset
df_Bio.head()

,s/n,athlete_id,name,sex,born,height,weight,country,country_noc,description,special_notes
0,1,16809,Károly Teppert,Male,1891-07-20,na,na,Hungary,HUN,Károly Teppert started competing in cycling in...,na
1,2,43737,Andrzej Socharski,Male,8/31/1947,173,72,Poland,POL,na,Listed in Olympians Who Won a Medal at the Wor...
2,3,50147,Nathalie Wunderlich,Female,6/3/1971,170,50,Switzerland,SUI,na,na
3,4,5085,Miha Lokar,Male,9/10/1935,182,76,Yugoslavia,YUG,na,Listed in Olympians Who Won a Medal at the Eur...
4,5,136329,Austin Hack,Male,5/17/1992,203,100,United States,USA,na,na

In [10]:
# to know the data types

df_Bio.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 155031 entries, 0 to 155030
Data columns (total 11 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   s/n            155031 non-null  int64
 1   athlete_id     155031 non-null  int64
 2   name           155031 non-null  object
 3   sex            155031 non-null  object
 4   born           155031 non-null  object
 5   height         155031 non-null  object
 6   weight         155031 non-null  object
 7   country        155031 non-null  object
 8   country_noc    155031 non-null  object
 9   description    155031 non-null  object
 10  special_notes  155031 non-null  object
dtypes: int64(2), object(9)
memory usage: 13.0+ MB

In [11]:
df_Bio.columns

Index(['s/n', 'athlete_id', 'name', 'sex', 'born', 'height', 'weight',
       'country', 'country_noc', 'description', 'special_notes'],
      dtype='object')

In [23]:
# if the table is already exists to drop the table
querry="DROP TABLE IF EXISTS  Athlete_Bio;"
curr.execute(querry)

In [24]:
# Creating table for  Althlete Bio
query=""" CREATE TABLE Athlete_Bio(
    Athlete_Bio_id int(6),
    Athlete_id int(6) PRIMARY KEY,
    name text(50),
    sex  text(6),
    born char(12),
    height numeric(6),
    weight numeric(6),
    country text(20),
    country_noc text(6),
    description text,
    special_notes  text)
"""

In [25]:
curr.execute(query)

In [26]:
# To check whether the table has been created

check = curr.execute("SELECT name FROM sqlite_master")
check.fetchone()

('Athlete_Bio',)

In [27]:
# Convert the dataset to set of tuples
df_Bio_Tuple=tuple(df_Bio.itertuples(index=False,name=None))
df_Bio.shape

(155031, 11)

In [28]:
# Creating the values 
insertQuery="""INSERT into  Athlete_Bio values(?,?,?,?,?,?,?,?,?,?,?) """

In [29]:
# Inserting many row at onces
curr.executemany(insertQuery,df_Bio_Tuple)

In [31]:
# Remember to commit the transaction after executing INSERT.
connector.commit()

In [32]:
querry="select * from Athlete_Bio"

In [33]:
# to view the new entry
curr.execute(querry)
results= curr.fetchone()
print(results)

(1, 16809, 'Károly Teppert', 'Male', '1891-07-20', 'na', 'na', ' Hungary', 'HUN', 'Károly Teppert started competing in cycling in the colors of Jóbarát KK in 1911 and moved to MTK in December that year. At the 1912 Stockholm Olympics, he competed in the road race, both individual and team. In addition to sports, Teppert also actively participated in the MTK bicycle division and the Hungarian Cycling Federation. After completing his career, he worked as a post officer.', 'na')

In [35]:
# connecting sql to pandas to view
sql_DF_Bio=pd.read_sql_query(querry,connector,parse_dates=["born"])
sql_DF_Bio.head()

,Athlete_Bio_id,Athlete_id,name,sex,born,height,weight,country,country_noc,description,special_notes
0,1,16809,Károly Teppert,Male,1891-07-20,na,na,Hungary,HUN,Károly Teppert started competing in cycling in...,na
1,2,43737,Andrzej Socharski,Male,1947-08-31,173,72,Poland,POL,na,Listed in Olympians Who Won a Medal at the Wor...
2,3,50147,Nathalie Wunderlich,Female,1971-06-03,170,50,Switzerland,SUI,na,na
3,4,5085,Miha Lokar,Male,1935-09-10,182,76,Yugoslavia,YUG,na,Listed in Olympians Who Won a Medal at the Eur...
4,5,136329,Austin Hack,Male,1992-05-17,203,100,United States,USA,na,na

In [36]:
# View the Event dataset
df_Event.head()

,s/n,edition,edition_id,country_noc,sport,event,result_id,athlete,athlete_id,pos,medal,isTeamSport
0,1,1908 Summer Olympics,5,ANZ,Athletics,"100 metres, Men",56265,Ernest Hutcheon,64710,DNS,na,False
1,2,1908 Summer Olympics,5,ANZ,Athletics,"400 metres, Men",56313,Henry Murray,64756,DNS,na,False
2,3,1908 Summer Olympics,5,ANZ,Athletics,"800 metres, Men",56338,Harvey Sutton,64808,3 h8 r1/2,na,False
3,4,1908 Summer Olympics,5,ANZ,Athletics,"800 metres, Men",56338,Guy Haskins,922519,DNS,na,False
4,5,1908 Summer Olympics,5,ANZ,Athletics,"800 metres, Men",56338,Joseph Lynch,64735,DNS,na,False

In [37]:
df_Event.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 314907 entries, 0 to 314906
Data columns (total 12 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   s/n          314907 non-null  int64
 1   edition      314907 non-null  object
 2   edition_id   314907 non-null  int64
 3   country_noc  314907 non-null  object
 4   sport        314907 non-null  object
 5   event        314907 non-null  object
 6   result_id    314907 non-null  int64
 7   athlete      314907 non-null  object
 8   athlete_id   314907 non-null  int64
 9   pos          314907 non-null  object
 10  medal        314907 non-null  object
 11  isTeamSport  314907 non-null  bool
dtypes: bool(1), int64(4), object(7)
memory usage: 26.7+ MB

In [38]:
df_Event.columns

Index(['s/n', 'edition', 'edition_id', 'country_noc', 'sport', 'event',
       'result_id', 'athlete', 'athlete_id', 'pos', 'medal', 'isTeamSport'],
      dtype='object')

In [39]:
# if the table is already exists to drop the table
querry="DROP TABLE IF EXISTS  Athlete_Events;"
curr.execute(querry)

In [42]:
query=  """CREATE TABLE Athlete_Events(
    Event_ID int(6) Primary Key,
    edition char(50),
    edition_id int(5),
    country_noc text(5),
    sport text(20),
    event char(20),
    result_id int(20),
    athlete text(50),
    athlete_id  int(50),
    pos varchar(10),
    medal text(10),
    isTeamSport text(10),
    FOREIGN KEY (athlete_id) REFERENCES Athlete_Bio (Athlete_id),
    FOREIGN KEY (athlete) REFERENCES Athlete_Bio (name)
 )"""

In [43]:
curr.execute(query)

In [44]:
df_Event_Tuple=tuple(df_Event.itertuples(index=False,name=None))
df_Event.shape

(314907, 12)

In [45]:
insertQuery="""INSERT into  Athlete_Events values(?,?,?,?,?,?,?,?,?,?,?,?)"""

In [46]:
curr.executemany(insertQuery,df_Event_Tuple)

In [47]:
# Remember to commit the transaction after executing INSERT.
connector.commit()

In [52]:
querry="select * from Athlete_Events"

curr.execute(querry)
results= curr.fetchone()
print(results)

(1, '1908 Summer Olympics', 5, 'ANZ', 'Athletics', '100 metres, Men', 56265, 'Ernest Hutcheon', 64710, 'DNS', 'na', '0')

In [54]:
sql_DF_Events=pd.read_sql_query(querry,connector)
sql_DF_Events.head()

,Event_ID,edition,edition_id,country_noc,sport,event,result_id,athlete,athlete_id,pos,medal,isTeamSport
0,1,1908 Summer Olympics,5,ANZ,Athletics,"100 metres, Men",56265,Ernest Hutcheon,64710,DNS,na,0
1,2,1908 Summer Olympics,5,ANZ,Athletics,"400 metres, Men",56313,Henry Murray,64756,DNS,na,0
2,3,1908 Summer Olympics,5,ANZ,Athletics,"800 metres, Men",56338,Harvey Sutton,64808,3 h8 r1/2,na,0
3,4,1908 Summer Olympics,5,ANZ,Athletics,"800 metres, Men",56338,Guy Haskins,922519,DNS,na,0
4,5,1908 Summer Olympics,5,ANZ,Athletics,"800 metres, Men",56338,Joseph Lynch,64735,DNS,na,0

In [56]:
df_Medal.head()

,s/n,edition,edition_id,year,country,country_noc,gold,silver,bronze,total
0,1,1896 Summer Olympics,1,1896,United States,USA,11,7,2,20
1,2,1896 Summer Olympics,1,1896,Greece,GRE,10,18,19,47
2,3,1896 Summer Olympics,1,1896,Germany,GER,6,5,2,13
3,4,1896 Summer Olympics,1,1896,France,FRA,5,4,2,11
4,5,1896 Summer Olympics,1,1896,Great Britain,GBR,2,3,2,7

In [55]:
df_Medal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1779 entries, 0 to 1778
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   s/n          1779 non-null   int64
 1   edition      1779 non-null   object
 2   edition_id   1779 non-null   int64
 3   year         1779 non-null   int64
 4   country      1779 non-null   object
 5   country_noc  1779 non-null   object
 6   gold         1779 non-null   int64
 7   silver       1779 non-null   int64
 8   bronze       1779 non-null   int64
 9   total        1779 non-null   int64
dtypes: int64(7), object(3)
memory usage: 139.1+ KB

In [57]:
querry="DROP TABLE IF EXISTS  Games_Medal_Rally;"
curr.execute(querry)

In [60]:
query="""CREATE TABLE Games_Medal_Rally(
    Medal_ID int(5) Primary Key,
    edition char(50),
    edition_id int(5),
    year char(4),
    country text(50),
    country_noc text(5),
    gold int(5),
    silver int(5),
     bronze int(5),
     total int (5),
    FOREIGN KEY ( edition_id) REFERENCES Athlete_Events_Results(edition_id)
     )"""

In [61]:
curr.execute(query)

In [62]:
df_Medal_Tuple=tuple(df_Medal.itertuples(index=False,name=None))
df_Medal.shape

(1779, 10)

In [63]:
insertQuery="""INSERT into Games_Medal_Rally values(?,?,?,?,?,?,?,?,?,?) """

In [64]:
curr.executemany(insertQuery,df_Medal_Tuple)

In [68]:
querry="SELECT * From  Games_Medal_Rally"
curr.execute(querry)
results= curr.fetchone()
print(results)

(1, '1896 Summer Olympics', 1, '1896', 'United States', 'USA', 11, 7, 2, 20)

In [69]:
sql_DF_Medal=pd.read_sql_query(querry,connector)
sql_DF_Medal.head()

,Medal_ID,edition,edition_id,year,country,country_noc,gold,silver,bronze,total
0,1,1896 Summer Olympics,1,1896,United States,USA,11,7,2,20
1,2,1896 Summer Olympics,1,1896,Greece,GRE,10,18,19,47
2,3,1896 Summer Olympics,1,1896,Germany,GER,6,5,2,13
3,4,1896 Summer Olympics,1,1896,France,FRA,5,4,2,11
4,5,1896 Summer Olympics,1,1896,Great Britain,GBR,2,3,2,7

In [70]:
df_Results.head()

,s/n,result_id,event_title,edition,edition_id,sport,sport_url,result_location,result_participants,result_format,result_detail,result_description,start_date,end_date,time
0,1,9270,"7 metres, 1907 Rating, Open",1920 Summer Olympics,7,Sailing,/editions/7/sports/SAL,Oostende,8 from 2 countries,"Three races, with final places decided by tota...",na,There were two yachts competing. Britain’s An...,7/7/1920,7/9/1920,na
1,2,29722,"Featherweight (≤60 kilograms), Men",1980 Summer Olympics,20,Weightlifting,/editions/20/sports/WLF,"Dvorets sporta Izmaylovo, Moskva",18 from 14 countries,Total of best lifts in snatch and clean & jerk...,na,The favorite was likely Soviet Viktor Mazin wh...,7/22/1980,na,14:00-19:00
2,3,54126,"Platform, Men",1948 Summer Olympics,12,Diving,/editions/12/sports/DIV,"Wembley Arena, Wembley, London",25 from 15 countries,10 metre platform. Final round only. Four comp...,na,"Sammy Lee won this event, leading in both the ...",8/4/1948,8/5/1948,na
3,4,4684,"100 metres Backstroke, Men",1920 Summer Olympics,7,Swimming,/editions/7/sports/SWM,"Zwemstadion van Antwerpen, Antwerpen",12 from 6 countries,na,na,Watten Paoa Kealoha set a world record of 1:14...,8/22/1920,8/23/1920,na
4,5,1465,"Slalom, Men",2002 Winter Olympics,47,Alpine Skiing,/editions/47/sports/ALP,"Park City Mountain Resort, Park City, Utah (Kn...",77 from 43 countries,"Two runs, total time determined placement.",Jesse Hunt,The last few World Cups had gone to Austrian B...,2/23/2002,na,na

In [71]:
df_Results.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7329 entries, 0 to 7328
Data columns (total 15 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   s/n                  7329 non-null   int64
 1   result_id            7329 non-null   int64
 2   event_title          7329 non-null   object
 3   edition              7329 non-null   object
 4   edition_id           7329 non-null   int64
 5   sport                7329 non-null   object
 6   sport_url            7329 non-null   object
 7   result_location      7329 non-null   object
 8   result_participants  7329 non-null   object
 9   result_format        7329 non-null   object
 10  result_detail        7329 non-null   object
 11  result_description   7329 non-null   object
 12  start_date           7329 non-null   object
 13  end_date             7329 non-null   object
 14  time                 7329 non-null   object
dtypes: int64(3), object(12)
memory usage: 859.0+ KB

7329

In [84]:
querry="DROP TABLE IF EXISTS  Results"

curr.execute(querry)

In [92]:
querrry=(""" CREATE TABLE RESULTS(
    RESLT_id int,
    result_id int(6) Primary Key,
    event_title  char(20),
    edition char(50),
    edition_id int(5),
    sport varchar(15),
    sport_url text(20),
    result_location  text(50),
    result_participants text(50),
    result_format  text(50),
    result_detail text(20),
    result_description text(20),
    start_date char(10),
    end_date char(10),
    time char(13),
    FOREIGN KEY (edition_id) REFERENCES  Athlete_Events (edition_id),
    FOREIGN KEY (edition_id) REFERENCES  Games (edition_id))
    
    """)

In [93]:
curr.execute(querrry)

In [94]:
df_Results_Tuple=tuple(df_Results.itertuples(index=False,name=None))
df_Results.shape

(7329, 15)

In [96]:
insertQuery="""INSERT into  RESULTS values(?,?,?,?,?,?,?,?,?,?,?,?,?,?,?)"""

In [97]:
curr.executemany(insertQuery,df_Results_Tuple)

In [98]:
querry="select * from RESULTS"
curr.execute(querry)
results= curr.fetchone()
print(results)

(1, 9270, '7 metres, 1907 Rating, Open', '1920 Summer Olympics', 7, 'Sailing', '/editions/7/sports/SAL', 'Oostende', '8 from 2 countries', 'Three races, with final places decided by total points. Point-for-place scoring for each race.', 'na', 'There were two yachts competing.  Britain’s Ancora lost the first race to Norway’s Fornebo, but won the final two races to win the gold medal.\n', '7/7/1920', '7/9/1920', 'na')

In [99]:
# Remember to commit the transaction after executing INSERT.
connector.commit()

In [72]:
querry="DROP TABLE IF EXISTS  Games"
curr.execute(querry)

In [100]:
df_Country

     s/n country_noc                    country
0      1         AFG                Afghanistan
1      2         ALB                    Albania
2      3         ALG                    Algeria
3      4         ASA             American Samoa
4      5         AND                    Andorra
..   ...         ...                        ...
229  230         YEM                      Yemen
230  231         YUG                 Yugoslavia
231  232         ZAM                     Zambia
232  233         ZIM                   Zimbabwe
233  234         ROC  Russian Olympic Committee

[234 rows x 3 columns]

In [111]:
querry="DROP TABLE IF EXISTS  Country;"
curr.execute(querry)

In [112]:
querry=""" CREATE TABLE Country(
    country_id int(3), 
  country_noc  text(4) , 
  country text(20) Primary Key,
  FOREIGN KEY ( country) REFERENCES Athlete_Bio(country)  

)"""

In [113]:
curr.execute(querry)

In [114]:
df_Country_Tuple=tuple(df_Country.itertuples(index=False,name=None))
df_Country.shape

(234, 3)

In [115]:
insertQuery="""INSERT into  Country values(?,?,?)"""

In [116]:
curr.executemany(insertQuery,df_Country_Tuple)

In [117]:
querry="select * from Country"
curr.execute(querry)
results= curr.fetchone()
print(results)

(1, 'AFG', 'Afghanistan')

In [73]:
df_Medal.columns

Index(['s/n', 'edition', 'edition_id', 'year', 'country', 'country_noc',
       'gold', 'silver', 'bronze', 'total'],
      dtype='object')

In [74]:
querry="""CREATE TABLE Games(
    Games_id int(6) Primary Key,
    edition char(50),
    edition_id int(5),
    edition_url varchar(20),
    year char(6),
    city text(20),
    country_flag_url char(50),
    country_noc text(5),
    start_date char(10),
    end_time char(10),
    isHeld char(6),
    competition_start_time char(10),
    competition_end_time char(10),
    FOREIGN KEY (edition_id) REFERENCES  Athlete_Events (edition_id),
    FOREIGN KEY (edition_id) REFERENCES  Games_Medal_Rally (edition_id),
    FOREIGN KEY (year) REFERENCES  Games_Medal_Rally (year)
    

) """

In [75]:
curr.execute(querry)

In [76]:
df_Games_Tuple=tuple(df_Games.itertuples(index=False,name=None))
df_Games.shape

(62, 13)

In [80]:
insertQuery="""INSERT into  Games values(?,?,?,?,?,?,?,?,?,?,?,?,?)"""

In [81]:
curr.executemany(insertQuery,df_Games_Tuple)

In [82]:
querry="select * from Games"

In [83]:
curr.execute(querry)
results= curr.fetchone()
print(results)

(1, '1896 Summer Olympics', 1, '/editions/1', '1896', 'Athina', '/images/flags/GRE.png', 'GRE', '1896-04-06', '1896-04-15', 'na', '1896-04-06', '1896-04-13')

In [118]:
# Closing the connector
connector.commit()
connector.close()

ProgrammingError: Cannot operate on a closed database.

In [120]:
os.getcwd()

'C:\\Users\\Dell\\Documents\\sql-course-materials\\SQL Course Materials\\Olypmic'

In [123]:
path="C:/Users/Dell/Documents/sql-course-materials/SQL Course Materials"

In [124]:
os.chdir(path)

In [125]:
## To view all table Created
%%capture
%load_ext sql
%sql sqlite:///Olympic_Data.db

In [126]:
%sql select * from sqlite_master where type='table'

 * sqlite:///Olympic_Data.db
Done.

[('table', 'Athlete_Bio', 'Athlete_Bio', 2, 'CREATE TABLE Athlete_Bio(\n    Athlete_Bio_id int(6),\n    Athlete_id int(6) PRIMARY KEY,\n    name text(50),\n    sex  text(6),\n    born char(12),\n    height numeric(6),\n    weight numeric(6),\n    country text(20),\n    country_noc text(6),\n    description text,\n    special_notes  text)'),
 ('table', 'Athlete_Events', 'Athlete_Events', 14967, 'CREATE TABLE Athlete_Events(\n    Event_ID int(6) Primary Key,\n    edition char(50),\n    edition_id int(5),\n    country_noc text(5),\n    sport te ... (150 characters truncated) ... isTeamSport text(10),\n    FOREIGN KEY (athlete_id) REFERENCES Athlete_Bio (Athlete_id),\n    FOREIGN KEY (athlete) REFERENCES Athlete_Bio (name)\n )'),
 ('table', 'Games_Medal_Rally', 'Games_Medal_Rally', 24048, 'CREATE TABLE Games_Medal_Rally(\n    Medal_ID int(5) Primary Key,\n    edition char(50),\n    edition_id int(5),\n    year char(4),\n    country text ... (47 characters truncated) ... ),\n    silver int(5),\n     bronze int(5),\n     total int (5),\n    FOREIGN KEY ( edition_id) REFERENCES Athlete_Events_Results(edition_id)\n     )'),
 ('table', 'Games', 'Games', 24081, 'CREATE TABLE Games(\n    Games_id int(6) Primary Key,\n    edition char(50),\n    edition_id int(5),\n    edition_url varchar(20),\n    year char(6), ... (291 characters truncated) ... d),\n    FOREIGN KEY (edition_id) REFERENCES  Games_Medal_Rally (edition_id),\n    FOREIGN KEY (year) REFERENCES  Games_Medal_Rally (year)\n    \n\n)'),
 ('table', 'RESULTS', 'RESULTS', 24085, 'CREATE TABLE RESULTS(\n    RESLT_id int,\n    result_id int(6) Primary Key,\n    event_title  char(20),\n    edition char(50),\n    edition_id int(5) ... (264 characters truncated) ...   time char(13),\n    FOREIGN KEY (edition_id) REFERENCES  Athlete_Events (edition_id),\n    FOREIGN KEY (edition_id) REFERENCES  Games (edition_id))'),
 ('table', 'Country', 'Country', 27211, 'CREATE TABLE Country(\n    country_id int(3), \n  country_noc  text(4) , \n  country text(20) Primary Key,\n  FOREIGN KEY ( country) REFERENCES Athlete_Bio(country)  \n\n)')]